
import re

#================================
# bmi 추출
#================================
test = "170 cm, //69.2kg"
print(re.findall('\d+.\d+', test))  # [170 69.2]

#================================
# 숫자만 추출
#================================
test = "결과: 241건"
num = int(re.findall('\d+', test)[0])
print(num)  # 241

test = "결과: 5,241건"
num = int(re.findall('\d+,\d+', test)[0].replace(',', ''))
print(num)  # 241

#================================
# 주민번호 뒷번호 * 표시하기
#================================
data = """
park 800905-1049118
kim  700905-1059119
"""

pat = re.compile("(\d{6})[-]\d{7}")
print(pat.sub("\g<1>-*******", data))
# park 800905-*******
# kim  700905-*******

#===========================================================================
# 머니투데이  10면1단  2018.11.05.  네이버뉴스   보내기 ==> 2018.11.05.만 빼내기
#===========================================================================
test = "머니투데이  10면1단  2018.11.05.  네이버뉴스   보내기"

r = re.compile('\d+.(\d+).(\d+).')
match = r.search(test).group(0)  # 2018.11.05.
print(match)

#===========================================================================
# # 전통의학 포탈 용량 가공
#===========================================================================
test = "구성약재 (총 8건)감초(甘草)A:3.75  백출(白朮)A:3.75  승마(升麻)A:1.125  시호(柴胡)A:1.125  인삼(人蔘)A:3.75  진피(陳皮)A:1.875  황기(黃芪)A:5.625  당귀신(當歸身):1.875 "

#p = re.compile('[^a-zA-Z]+')
p = re.compile('\d+.\d+')

m = p.findall(test)
print(m)


#===========================================================================
# 전통의학 포탈 용량 가공
# 한글 코드 범위
# ㄱ ~ ㅎ: 0x3131 ~ 0x314e
# ㅏ ~ ㅣ: 0x314f ~ 0x3163
# 가 ~ 힣: 0xac00 ~ 0xd7a3
# 출처: https://jokergt.tistory.com/52 [Gun's Knowledge Base]
#===========================================================================
s='韓子는 싫고, 한글은 nice하다. English 쵝오 -_-ㅋㅑㅋㅑ ./?!'
hangul = re.compile('[^ ㄱ-ㅣ가-힣]+') # 한글과 띄어쓰기를 제외한 모든 글자
# hangul = re.compile('[^ \u3131-\u3163\uac00-\ud7a3]+')  # 위와 동일
result = hangul.sub('', s) # 한글과 띄어쓰기를 제외한 모든 부분을 제거
print (result)

result = hangul.findall(s) # 정규식에 일치되는 부분을 리스트 형태로 저장
print (result)

#===========================================================================
# 파일명으로 불필요한 문자제거
#===========================================================================
file_tmp = "?abc_^^%.pdf"
out_filename = re.sub('[-=+,#/\?:^$.@*\"※~&%ㆍ!』\\‘|\(\)\[\]\<\>`\'…》]', '', file_tmp)
print(out_filename)

